### Pandas

In [3]:
import pandas as p

In [4]:
#One dimensional series 
    s=p.Series([1,2,3,3,4,5,6])

In [5]:
s

0    1
1    2
2    3
3    3
4    4
5    5
6    6
dtype: int64

In [8]:
s[s>3]

4    4
5    5
6    6
dtype: int64

In [12]:
#dictionary:
d={"a":1,"b":2,"c":3}
ds=p.Series(d)        # typecast to python series
ds

a    1
b    2
c    3
dtype: int64

In [14]:
#index series values with internal and external indexing  ...
#both ds[0] and ds["a"] are allowed
ds[0]

1

In [17]:
d2={"a":[1,2,3],"b":[2,3,4],"c":[5,6,7]}
sd2=p.Series(d2)
sd2

a    [1, 2, 3]
b    [2, 3, 4]
c    [5, 6, 7]
dtype: object

In [29]:
#dataframes.. keys become  column names ..
dfd2=p.DataFrame(d2)
#select val with column 'a'
dfd2['a'] 
#dfd2[0] not allowed

0    1
1    2
2    3
Name: a, dtype: int64

In [28]:
dfd2.columns  #print list of columns..

Index(['a', 'b', 'c'], dtype='object')

In [34]:
dfd2.iloc[0,0]#integer locations ...

1

In [36]:
#index using location...
dfd2.loc[0,"a"]  #2nd attrib name of column

1

In [39]:
#selecting first two rows and columns;.
dfd2.iloc[0:2,0:2]

   a  b
0  1  2
1  2  3

In [42]:
d3={"a":[1,2,3],"b":[2,3,4]}
pdd3=p.DataFrame(d3)
pdd3

   a  b
0  1  2
1  2  3
2  3  4

In [48]:
#Missing values will be as NaN -Not A Number..
#while appending index do not change ..just append occours to avert the same use ignore_index flag as arguement to reset index
df4=pdd3.append(dfd2,ignore_index=True)
df4

C:\Users\Admin\AppData\Local\Temp\ipykernel_31720\4112888638.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df4=pdd3.append(dfd2,ignore_index=True)

   a  b    c
0  1  2  NaN
1  2  3  NaN
2  3  4  NaN
3  1  2  5.0
4  2  3  6.0
5  3  4  7.0

In [49]:
df4.info()      #Information about dataframe .

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       6 non-null      int64
 1   b       6 non-null      int64
 2   c       3 non-null      float64
dtypes: float64(1), int64(2)
memory usage: 272.0 bytes

In [50]:
df4.loc[0,'a']

1

In [78]:
d1={"name":['a','b','c'],"food":['apple','orange','banana']}
d2={"sample":['a','b','d'],"drink":["milk","coffee","tea"]}
dfd1=p.DataFrame(d1)
dfd2=p.DataFrame(d2)
dfd1

  name    food
0    a   apple
1    b  orange
2    c  banana

In [81]:
p.merge(dfd1,dfd2,how="inner",left_on="name",right_on='sample') #ARG  1 left table 2,Righttable . 3 how =inner(default ),

  name    food sample   drink
0    a   apple      a    milk
1    b  orange      b  coffee

In [68]:
p.merge(dfd1,dfd2,how="right")

  name    food   drink
0    a   apple    milk
1    b  orange  coffee
2    d     NaN     tea

In [72]:
#arg  on -> on which column to perform join  ..
p.merge(dfd1,dfd2,how="right",on="name")

  name    food   drink
0    a   apple    milk
1    b  orange  coffee
2    d     NaN     tea

In [77]:
p.merge(dfd1,dfd2,left_on="name",right_on='sample')# indicate both different columnn names consist of same value /..

  name    food sample   drink
0    a   apple      a    milk
1    b  orange      b  coffee